In [16]:
#importacion de las librerias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [111]:
# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

In [23]:
# Configura la opción de visualización para mostrar todas las columnas del DataFrame, sin limitaciones.
pd.set_option('display.max_columns', None)

In [24]:
## 2. importacion de los datos Customer Flight Analysis.csv

df_vuelos_clientes = pd.read_csv("./Files./Customer_Flight_Activity.csv", index_col=0)# La primera columna del archivo será utilizada como índice.
df_vuelos_clientes.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [ ]:
df_vuelos_clientes.info #informacion general de df

<bound method DataFrame.info of                 Year  Month  Flights Booked  Flights with Companions  \
Loyalty Number
100018          2017      1               3                        0
100102          2017      1              10                        4
100140          2017      1               6                        0
100214          2017      1               0                        0
100272          2017      1               0                        0
...              ...    ...             ...                      ...
999902          2018     12               0                        0
999911          2018     12               0                        0
999940          2018     12               3                        0
999982          2018     12               0                        0
999986          2018     12               0                        0

                Total Flights  Distance  Points Accumulated  Points Redeemed  \
Loyalty Number
100018                      3      1521               152.0                0
100102                     14      2030               203.0                0
100140                      6      1200               120.0                0
100214                      0         0                 0.0                0
100272                      0         0                 0.0                0
...                       ...       ...                 ...              ...
999902                      0         0                 0.0                0
999911                      0         0                 0.0                0
999940                      3      1233               123.0                0
999982                      0         0                 0.0                0
999986                      0         0                 0.0                0

                Dollar Cost Points Redeemed
Loyalty Number
100018                                    0
100102                                    0
100140                                    0
100214                                    0
100272                                    0
...                                     ...
999902                                    0
999911                                    0
999940                                    0
999982                                    0
999986                                    0

[405624 rows x 9 columns]>

In [25]:
# Mostrar número de filas y columnas.
df_vuelos_clientes.shape

(405624, 9)

In [28]:
# Muestra los nombres de todas las columnas.
df_vuelos_clientes.columns

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [ ]:
# Genera un resumen estadístico de las columnas numéricas del DataFrame.El dataframe es solo numérico, no se puede mirar el resumen estadistico en las columnas categóricas.
df_vuelos_clientes.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [ ]:
#muestra los valores nulos
df_vuelos_clientes.isnull().sum()

Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [30]:
# Muestra el tipo de dato de cada columna.
df_vuelos_clientes.dtypes

Year                             int64
Month                            int64
Flights Booked                   int64
Flights with Companions          int64
Total Flights                    int64
Distance                         int64
Points Accumulated             float64
Points Redeemed                  int64
Dollar Cost Points Redeemed      int64
dtype: object

In [ ]:
df_vuelos_clientes["Points Redeemed"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [64]:
df_vuelos_clientes["Dollar Cost Points Redeemed"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [ ]:
df_vuelos_clientes["Month"].unique()#Comprobar que los numeros son del 1 al 12

array([ 1,  9,  2,  3, 11,  4,  5,  7,  6,  8, 10, 12], dtype=int64)

In [65]:
df_vuelos_clientes["Distance"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [46]:
# Muestra el número total de filas duplicadas.
df_vuelos_clientes.duplicated().sum()

228705

In [ ]:
## cambiar el formato del mes de números a texto
## no hay valores nulos
## si hay duplicados

In [26]:
#Importación de los datos Customer Loyalty History.csv

df_datos_clientes = pd.read_csv('./files/Customer_Loyalty_History.csv', index_col=0)# La primera columna del archivo será utilizada como índice
df_datos_clientes.head()

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [27]:
# Mostrar número de filas y columnas.
df_datos_clientes.shape

(16737, 15)

In [ ]:
df_datos_clientes.info #informacin general de df

<bound method DataFrame.info of                Country          Province        City Postal Code  Gender  \
Loyalty Number
480934          Canada           Ontario     Toronto     M2Z 4K1  Female
549612          Canada           Alberta    Edmonton     T3G 6Y6    Male
429460          Canada  British Columbia   Vancouver     V6E 3D9    Male
608370          Canada           Ontario     Toronto     P1W 1K4    Male
530508          Canada            Quebec        Hull     J8Y 3Z5    Male
...                ...               ...         ...         ...     ...
823768          Canada  British Columbia   Vancouver     V6E 3Z3  Female
680886          Canada      Saskatchewan      Regina     S1J 3C5  Female
776187          Canada  British Columbia   Vancouver     V5R 1W3    Male
906428          Canada             Yukon  Whitehorse     Y2K 6R0    Male
652627          Canada          Manitoba    Winnipeg     R2C 0M5  Female

               Education    Salary Marital Status Loyalty Card       CLV  \
Loyalty Number
480934          Bachelor   83236.0        Married         Star   3839.14
549612           College       NaN       Divorced         Star   3839.61
429460           College       NaN         Single         Star   3839.75
608370           College       NaN         Single         Star   3839.75
530508          Bachelor  103495.0        Married         Star   3842.79
...                  ...       ...            ...          ...       ...
823768           College       NaN        Married         Star  61850.19
680886          Bachelor   89210.0        Married         Star  67907.27
776187           College       NaN         Single         Star  74228.52
906428          Bachelor  -57297.0        Married         Star  10018.66
652627          Bachelor   75049.0        Married         Star  83325.38

               Enrollment Type  Enrollment Year  Enrollment Month  \
Loyalty Number
480934                Standard             2016                 2
549612                Standard             2016                 3
429460                Standard             2014                 7
608370                Standard             2013                 2
530508                Standard             2014                10
...                        ...              ...               ...
823768                Standard             2012                12
680886                Standard             2014                 9
776187                Standard             2014                 3
906428          2018 Promotion             2018                 4
652627                Standard             2015                12

                Cancellation Year  Cancellation Month
Loyalty Number
480934                        NaN                 NaN
549612                        NaN                 NaN
429460                     2018.0                 1.0
608370                        NaN                 NaN
530508                        NaN                 NaN
...                           ...                 ...
823768                        NaN                 NaN
680886                        NaN                 NaN
776187                        NaN                 NaN
906428                        NaN                 NaN
652627                     2016.0                 8.0

[16737 rows x 15 columns]>

In [29]:
# Muestra los nombres de todas las columnas.
df_datos_clientes.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [31]:
# Muestra el tipo de dato de cada columna.
df_datos_clientes.dtypes

Country                object
Province               object
City                   object
Postal Code            object
Gender                 object
Education              object
Salary                float64
Marital Status         object
Loyalty Card           object
CLV                   float64
Enrollment Type        object
Enrollment Year         int64
Enrollment Month        int64
Cancellation Year     float64
Cancellation Month    float64
dtype: object

In [ ]:
df_datos_clientes["Postal Code"].value_counts()#comprobar si el código postal era solo numerico

In [ ]:
df_datos_clientes["Gender"].value_counts() #Mirar si estan definidos como male y female

In [ ]:
df_datos_clientes["Education"].value_counts()#Mirar como estan definidos

In [ ]:
df_datos_clientes["Marital Status"].value_counts() #Mirar como estan definidos

Marital Status
Married     9735
Single      4484
Divorced    2518
Name: count, dtype: int64

In [ ]:
df_datos_clientes["Loyalty Card"].unique()#Mirar si indica el nivel

array(['Star', 'Aurora', 'Nova'], dtype=object)

In [103]:
# Muestra el número total de filas duplicadas.
df_datos_clientes.duplicated().sum()

0

In [105]:
#muestra los valores nulos
df_datos_clientes.isnull().sum()/df_datos_clientes.shape[0]*100

Country                0.000000
Province               0.000000
City                   0.000000
Postal Code            0.000000
Gender                 0.000000
Education              0.000000
Salary                25.321145
Marital Status         0.000000
Loyalty Card           0.000000
CLV                    0.000000
Enrollment Type        0.000000
Enrollment Year        0.000000
Enrollment Month       0.000000
Cancellation Year     87.650117
Cancellation Month    87.650117
dtype: float64

In [66]:
# Genera un resumen estadístico de las columnas numéricas del DataFrame.
df_datos_clientes.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

In [67]:
# Genera un resumen estadístico de las columnas categóricas del DataFrame.
df_datos_clientes.describe(include='object').T

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

In [ ]:
df_datos_clientes["Enrollment Month"].unique()#mirar si esta en números del 1 al 12

array([ 2,  3,  7, 10,  5,  6, 12,  1, 11,  8,  4,  9], dtype=int64)

In [ ]:
#Enrollment Month pasar de int a texto
#Cancellation Year,Cancellation Month eliminar por que la mayoria son nulos.
#Hay salarios negativos pasarlos a valor absoluto(no negativo)
#Hay salarios nulos, decidir que hacer con ellos

In [70]:
#Unir los Df por merge left por que quiero todos los datos de los vuelos y los clientes 
df = df_vuelos_clientes.merge(df_datos_clientes,on = "Loyalty Number", how="left")
df.sample(5)

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,,,,,,,,,,
424812,2017,4,10,0,10,1690,169.0,0,0,Canada,British Columbia,West Vancouver,V6V 8Z3,Female,Bachelor,104990.0,Divorced,Nova,39365.30,Standard,2015,1,NaN,NaN
694942,2017,6,2,0,2,4194,419.0,0,0,Canada,Quebec,Tremblant,H5Y 2S9,Female,Master,85959.0,Divorced,Nova,12168.74,Standard,2014,3,NaN,NaN
893057,2018,9,5,5,10,810,81.0,0,0,Canada,British Columbia,Victoria,V10 6T5,Male,Bachelor,83224.0,Married,Nova,4061.59,Standard,2016,3,NaN,NaN
698573,2018,6,19,6,25,2525,252.0,0,0,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,Bachelor,64605.0,Married,Star,24723.18,Standard,2013,8,NaN,NaN
348056,2018,9,5,5,10,660,66.0,562,45,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,63910.0,Married,Nova,10209.93,Standard,2017,5,NaN,NaN

In [ ]:
#Cancellation Year,Cancellation Month eliminar porque mas de un 87%  son nulos.
df.drop(columns=['Cancellation Year', 'Cancellation Month'], axis = 1, inplace = True)#axis le digo que es una columna e inplace= True por que quiero que lo elimine del df

In [ ]:
df.columns #comprobar que se han eliminado

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed', 'Country', 'Province', 'City',
       'Postal Code', 'Gender', 'Education', 'Salary', 'Marital Status',
       'Loyalty Card', 'CLV', 'Enrollment Type', 'Enrollment Year',
       'Enrollment Month'],
      dtype='object')

In [ ]:
## cambiar el formato de Month y Enrollment Month  de int a texto , para poder cambiar los números por texto en los meses del año
columnas = ["Month", "Enrollment Month"]
for i in columnas: 
    df[i]= df[i].astype(object)

In [ ]:
df["Enrollment Month"].dtype #Controlar que ha cambiado el formato

dtype('O')

In [ ]:
df["Month"].dtype #Controlar que ha cambiado el formato

dtype('O')

In [90]:
#cambiar los numeros por el texto en los mese del año
columnas = ["Month", "Enrollment Month"]
for i in columnas:
    df[i]= df[i].replace({1: "January", 2: "Februar", 3: "March", 4: "April", 5: "May", 6:"June", 7:"July", 8:"August", 9 :"September", 10:"October", 11:"November",12:"December"})

In [95]:
df["Month"].unique()# comprobar si estan cambiadas las columnas

array(['January', 'September', 'Februar', 'March', 'November', 'April',
       'May', 'July', 'June', 'August', 'October', 'December'],
      dtype=object)

In [ ]:
df["Enrollment Month"].value_counts() #comprobar si estan cambiadas las columnas

Enrollment Month
May          36480
December     35832
July         35712
November     35064
October      35016
August       34560
June         34056
September    33792
April        33696
March        32880
Februar      29568
January      28968
Name: count, dtype: int64

In [97]:
# Convierte los valores negativos en la columna 'Salary' a positivos, manteniendo solo el valor absoluto.
df['Salary'] = df['Salary'].abs()

In [ ]:
df["Salary"].min() #Comprobar si ha realizado el cambio

9081.0

In [101]:
#Eliminar filas duplicados
df.drop_duplicates(subset=None,keep='first',inplace=True) #subset none(quiero eliminar las filas enteras duplicadas)keep, me quedo con la primera fila duplicada

In [ ]:
df.shape# Mostrar número de filas y columnas.

(403760, 22)

In [112]:
#Hay salarios nulos, como son el 25% que es un porcentaje alto, considero utilizar Iterative Imputer, que rellenara los huecos de los salarios para que la información tenga sentido

imputer_iter = IterativeImputer(max_iter = 100, random_state = 42)
df['Salary'] = imputer_iter.fit_transform(df[['Salary']])

In [113]:
df.isnull().sum()/df_datos_clientes.shape[0]*100

Year                           0.0
Month                          0.0
Flights Booked                 0.0
Flights with Companions        0.0
Total Flights                  0.0
Distance                       0.0
Points Accumulated             0.0
Points Redeemed                0.0
Dollar Cost Points Redeemed    0.0
Country                        0.0
Province                       0.0
City                           0.0
Postal Code                    0.0
Gender                         0.0
Education                      0.0
Salary                         0.0
Marital Status                 0.0
Loyalty Card                   0.0
CLV                            0.0
Enrollment Type                0.0
Enrollment Year                0.0
Enrollment Month               0.0
dtype: float64